---

C#Visual BasicVisual C++

Revit 2024 API
---
MEPSystem..::..Remove Method (ConnectorSet)
MEPSystem Class See Also Send Feedback
---

Removes connectors from system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void Remove(
    	ConnectorSet connectors
    )

Visual Basic
---

    Public Sub Remove ( _
    	connectors As ConnectorSet _
    )

Visual C++
---

    public:
    void Remove(
    	ConnectorSet^ connectors
    )

#### Parameters

connectors
    Type: Autodesk.Revit.DB..::..ConnectorSetThe connectors to be removed from the system.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument elements is nullNothingnullptra null reference (Nothing in Visual Basic), or any element in that collection is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when some of the connectors can't be removed, or when trying to remove all connectors from the system. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the operation failed. |

# See Also

MEPSystem Class

Remove Overload

Autodesk.Revit.DB Namespace